tutorials/sonicSRFFoam/mucZero_1/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 0.1;

vertices        
(
//Rotor
//0. Row
// 	(0 2 0) // alt
// 	(-1.071989	1.688443	0.00000) //neu // 0
	(-0.731864	1.861283	-2.0)// 0
// 	(1.7321 -1 0) //alt
// 	(1.998229	0.084148 0) // neu // 1
	(1.977851	-0.296828 -2.0)// 1
	(-1.7321 -1 -2.0) // 2
// 	(0 5 0) //alt
// 	(-2.679973	4.221107	0.000000) //neu // 3
	(-0.937232	4.911374	-2.000000) // 3
// 	(4.3301 -2.5 0) //alt
// 	(4.995572	0.210371 0.0) // neu // 4
	(4.721991	-1.644020 -2.0) // 4
	(-4.3301 -2.5 -2.0) // 5
//1. Row
// 	(0 2 1) // alt
	(-0.731864	1.861283	1.337734) // neu // 6
// 	(1.7321 -1 1) //alt
	(1.977851	-0.296828	1.337734) // // 7
	(-1.7321 -1 1) // 8
// 	(0 5 1) // alt
	(-0.937232	4.911374	1.666667) // neu // 9
// 	(4.3301 -2.5 1) // alt
	(4.721991	-1.644020	1.666667) //neu // 10
	(-4.3301 -2.5 1) // 11

// 2. Row
// 	(0.0698 1.9988 2) // alt
	(0.011559	1.999967	2.013077) // neu - 3 //12
// 	(1.7659 -.9389 2) //alt
	(1.737801	-0.989973	1.986923)  // neu - 3 //13
// 	(1.6961 -1.0598 2) //alt
	(1.726243	-1.009993	2.013077) // neu - 4 //14
	(-1.6961 -1.0598 2) //15
	(-1.7659 -.9389 2) //16
// 	(-0.0698 1.9988 2) // alt
	(-0.011559	1.999967	1.986923) // neu - 4 //17
// 	(0.1745 4.9970 2) // alt
	(0.002327	4.999999	2.006582) // neu - 3 //18
// 	(4.4147 -2.3474 2) // alt
	(4.331290	-2.497984	1.993418) // neu - 3 //19
// 	(4.2402 -2.6496 2) // alt
	(4.328963	-2.502015	2.006582) // neu - 3 //20
	(-4.2402 -2.6496 2) //21
	(-4.4147 -2.3474 2) //22
// 	(-0.1745 4.9970 2) // alt
	(-0.002327	4.999999	1.993418) //neu - 4 //23

// 3. Row
// 	(0 2 3) // alt
	(0.731864	1.861283	2.662266) // neu // 24
// 	(1.7321 -1 3) // alt
	(1.245986	-1.564455	2.662266) //neu - 2 //25
	(-1.7321 -1 3) //26
// 	(0 5 3) // alt
	(0.937232	4.911374	2.333333) // neu //27
// 	(4.3301 -2.5 3) // alt
	(3.784759	-3.267354	2.333333) // neu - 2 //28
	(-4.3301 -2.5 3) //29

// 4. Row
// 	(0 2 4) //alt
// 	(1.071989	1.688443	4.00000) //neu //30
	(0.731864	1.861283	4.00000)  //30
// 	(1.7321 -1 4) // alt
// 	(0.926240	-1.772591 4) //neu - 5 //31
	(1.245986	-1.564455 4) //31
	(-1.7321 -1 4) //32
// 	(0 5 4) //alt
// 	(2.679973	4.221107	4.000000) //neu //33
	(0.937232	4.911374	4.000000) //33
// 	(4.3301 -2.5 4) // alt
// 	(2.315599	-4.431478 4) // neu - 5 //34
	(3.784759	-3.267354 4) //34
	(-4.3301 -2.5 4) //35

//Stator
//0. Row
	(0 2 4) //36
	(1.7321 -1 4) //37
	(-1.7321 -1 4) //38
	(0 5 4) //39
	(4.3301 -2.5 4) //40
	(-4.3301 -2.5 4) //41
//1. Row
	(0 2 5) //42
	(1.7321 -1 5) //43
	(-1.7321 -1 5) //44
	(0 5 5) //45
	(4.3301 -2.5 5) //46
	(-4.3301 -2.5 5) //47

// 2. Row
	(0.0698 1.9988 6)
	(1.7659 -.9389 6)
	(1.6961 -1.0598 6)
	(-1.6961 -1.0598 6)
	(-1.7659 -.9389 6)
	(-0.0698 1.9988 6)
	(0.1745 4.9970 6)
	(4.4147 -2.3474 6)
	(4.2402 -2.6496 6)
	(-4.2402 -2.6496 6)
	(-4.4147 -2.3474 6)
	(-0.1745 4.9970 6)

// 3. Row
	(0 2 7) //60
	(1.7321 -1 7) //61
	(-1.7321 -1 7) //62
	(0 5 7) //63
	(4.3301 -2.5 7) //64
	(-4.3301 -2.5 7) //65

// 4. Row
	(0 2 8) //66
	(1.7321 -1 8) //67
	(-1.7321 -1 8) //68
	(0 5 8) //69
	(4.3301 -2.5 8) //70
	(-4.3301 -2.5 8) //71
);

blocks          
(
//Rotor
//1. Row
    hex (0 1 4 3 6 7 10 9) rotor (48 12 30) simpleGrading (1 1 1)
//     hex (5 4 1 2 11 10 7 8) rotor (12 12 5) simpleGrading (1 1 1)
//     hex (2 0 3 5 8 6 9 11) rotor (12 12 5) simpleGrading (1 1 1)
//2. Row
    hex (6 7 10 9 12 13 19 18) rotor (48 12 5) simpleGrading (1 1 1)
//     hex (11 10 7 8 21 20 14 15) rotor (12 12 5) simpleGrading (1 1 1)
//     hex (8 6 9 11 16 17 23 22) rotor (12 12 5) simpleGrading (1 1 1)
//3. Row
    hex (12 13 19 18 24 25 28 27) rotor (48 12 5) simpleGrading (1 1 1)
//     hex (21 20 14 15 29 28 25 26) rotor (12 12 5) simpleGrading (1 1 1)
//     hex (16 17 23 22 26 24 27 29) rotor (12 12 5) simpleGrading (1 1 1)
//4. Row
    hex (24 25 28 27 30 31 34 33) rotor (48 12 10) simpleGrading (1 1 1)
//     hex (29 28 25 26 35 34 31 32) rotor (12 12 5) simpleGrading (1 1 1)
//     hex (26 24 27 29 32 30 33 35) rotor (12 12 5) simpleGrading (1 1 1)
//Stator
//1. Row
    hex (36 37 40 39 42 43 46 45) (48 12 5) simpleGrading (1 1 1)
//     hex (41 40 37 38 47 46 43 44) (12 12 5) simpleGrading (1 1 1)
//     hex (38 36 39 41 44 42 45 47) (12 12 5) simpleGrading (1 1 1)
//2. Row
    hex (42 43 46 45 48 49 55 54) (48 12 5) simpleGrading (1 1 1)
//     hex (47 46 43 44 57 56 50 51) (12 12 5) simpleGrading (1 1 1)
//     hex (44 42 45 47 52 53 59 58) (12 12 5) simpleGrading (1 1 1)
//3. Row
    hex (48 49 55 54 60 61 64 63) (48 12 5) simpleGrading (1 1 1)
//     hex (57 56 50 51 65 64 61 62) (12 12 5) simpleGrading (1 1 1)
//     hex (52 53 59 58 62 60 63 65) (12 12 5) simpleGrading (1 1 1)
//4. Row
    hex (60 61 64 63 66 67 70 69) (48 12 5) simpleGrading (1 1 1)
//     hex (65 64 61 62 71 70 67 68) (12 12 5) simpleGrading (1 1 1)
//     hex (62 60 63 65 68 66 69 71) (12 12 5) simpleGrading (1 1 1)
);

edges           
(
//Rotor
//0. Row
    arc 0 1 (2 0 -2)
//     arc 1 2 (0 -2 0)
//     arc 2 0 (-2 0 0)
    arc 3 4 (5 0 -2)
//     arc 4 5 (0 -5 0)
//     arc 5 3 (-5 0 0)
//1. Row
//     arc 6 7 (2 0 1) //alt
    arc 6 7 (2 0 1.337734) //neu
//     arc 7 8 (0 -2 1)
//     arc 8 6 (-2 0 1)
//     arc 9 10 (5 0 1) //alt
    arc 9 10 (5 0 1.666667) //neu
//     arc 10 11 (0 -5 1)
//     arc 11 9 (-5 0 1)
//2. Row
    arc 12 13 (2 0 2)
//     arc 14 15 (0 -2 2)
//     arc 16 17 (-2 0 2)
    arc 18 19 (5 0 2)
//     arc 20 21 (0 -5 2)
//     arc 22 23 (-5 0 2)
//3. Row
//     arc 24 25 (2 0 3) //alt
    arc 24 25 (2 0 2.662266) //neu
//     arc 25 26 (0 -2 3)
//     arc 26 24 (-2 0 3)
//     arc 27 28 (5 0 3) //alt
    arc 27 28 (5 0 2.333333) //neu
//     arc 28 29 (0 -5 3)
//     arc 29 27 (-5 0 3)
//4. Row
    arc 30 31 (2 0 4)
//     arc 31 32 (0 -2 4)
//     arc 32 30 (-2 0 4)
    arc 33 34 (5 0 4)
//     arc 34 35 (0 -5 4)
//     arc 35 33 (-5 0 4)

//Stator
//0. Row
    arc 36 37 (2 0 4)
//     arc 37 38 (0 -2 4)
//     arc 38 36 (-2 0 4)
    arc 39 40 (5 0 4)
//     arc 40 41 (0 -5 4)
//     arc 41 39 (-5 0 4)
//1. Row
    arc 42 43 (2 0 5)
//     arc 43 44 (0 -2 5)
//     arc 44 42 (-2 0 5)
    arc 45 46 (5 0 5)
//     arc 46 47 (0 -5 5)
//     arc 47 45 (-5 0 5)
//2. Row
    arc 48 49 (2 0 6)
//     arc 50 51 (0 -2 6)
//     arc 52 53 (-2 0 6)
    arc 54 55 (5 0 6)
//     arc 56 57 (0 -5 6)
//     arc 58 59 (-5 0 6)
//3. Row
    arc 60 61 (2 0 7)
//     arc 61 62 (0 -2 7)
//     arc 62 60 (-2 0 7)
    arc 63 64 (5 0 7)
//     arc 64 65 (0 -5 7)
//     arc 65 63 (-5 0 7)
//4. Row
    arc 66 67 (2 0 8)
//     arc 67 68 (0 -2 8)
//     arc 68 66 (-2 0 8)
    arc 69 70 (5 0 8)
//     arc 70 71 (0 -5 8)
//     arc 71 69 (-5 0 8)

);

patches
(


    wall rotorhub
    (
//Hub
	(0 1 7 6)
// 	(0 6 8 2)
// 	(7 1 2 8)
	(6 7 13 12)
// 	(6 17 16 8)
// 	(14 7 8 15)
	(12 13 25 24)
// 	(16 17 24 26)
// 	(25 14 15 26)
	(24 25 31 30)
// 	(26 24 30 32)
// 	(31 25 26 32)
//Blades
	(12 18 9 6)
	(24 27 18 12)
// 	(6 9 23 17)
// 	(17 23 27 24)
// 	(14 20 10 7)
// 	(25 28 20 14)
	(7 10 19 13)
	(13 19 28 25)
// 	(8 16 22 11)
// 	(16 26 29 22)
// 	(8 11 21 15)
// 	(15 21 29 26)
    )

    wall rotorshroud 
    (
 //Shroud
	(4 3 9 10)
// 	(9 3 5 11)
// 	(4 10 11 5)
	(10 9 18 19)
// 	(9 11 22 23)
// 	(10 20 21 11)
	(19 18 27 28)
// 	(27 23 22 29)
// 	(20 28 29 21)
	(27 33 34 28)
// 	(29 35 33 27)
// 	(28 34 35 29)
    )

    wall stator 
    (
//Hub
	(36 37 43 42)
// 	(38 36 42 44)
// 	(43 37 38 44)
	(42 43 49 48)
// 	(42 53 52 44)
// 	(50 43 44 51)
	(48 49 61 60)
// 	(52 53 60 62)
// 	(61 50 51 62)
	(60 61 67 66)
// 	(62 60 66 68)
// 	(67 61 62 68)
//Blade
	(43 46 55 49)
	(49 55 64 61)
// 	(43 50 56 46)
// 	(50 61 64 56)
	(42 48 54 45)
	(48 60 63 54)
// 	(60 53 59 63)
// 	(42 45 59 53)
// 	(44 52 58 47)
// 	(52 62 65 58)
// 	(44 47 57 51)
// 	(57 65 62 51)
//Shroud
	(46 40 39 45)
// 	(45 39 41 47)
// 	(40 46 47 41)
	(55 46 45 54)
// 	(59 45 47 58)
// 	(46 56 57 47)
	(64 55 54 63)
// 	(63 59 58 65)
// 	(56 64 65 57)
	(70 64 63 69)
// 	(69 63 65 71)
// 	(64 70 71 65)
    )

/*
    patch insideSlider 
    (
	(31 34 33 30)
	(30 33 35 32)
	(34 31 32 35)
    )

    patch outsideSlider 
    (
	(37 36 39 40)
	(36 38 41 39)
	(37 40 41 38)
    )
*/
/*
    cyclic rotorStator
    (
	(31 34 33 30)
// 	(30 33 35 32)
// 	(34 31 32 35)
	(37 36 39 40)
// 	(36 38 41 39)
// 	(37 40 41 38)
    )*/

    patch rotorStator1
    (
	(31 34 33 30)
// 	(37 36 39 40)
    )

    patch rotorStator2
    (
// 	(31 34 33 30)
	(37 36 39 40)
    )

    patch inlet
    (
	(4 1 0 3)
// 	(3 0 2 5)
// 	(1 4 5 2)
    )

    patch outlet
    (
	(67 70 69 66)
// 	(66 69 71 68)
// 	(70 67 68 71)
    )

    cyclic statorCyclic
//     symmetryPlane statorCyclic
    (
	(36 42 45 39)
	(60 66 69 63)
	(40 46 43 37)
	(64 70 67 61)
    )

    cyclic rotorCyclic
//     symmetryPlane rotorCyclic
    (
	(0 6 9 3)
	(24 30 33 27)
	(4 10 7 1)
	(28 34 31 25)
    )
);

mergePatchPairs
(

//     ( insideSlider outsideSlider )

);


// ************************************************************************* //
