tutorials/sonicSRFFoam/mucZero_1/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
//     default         Euler;
    default CoEuler phi rho 0.5; // local time stepping with constant Courant number <mass flux var> <density var> <max local Courant number>
//     default SLTS phi rho 0.5; // stabelized local time stepping <mass flux var> <density var> <Under-relaxation factor>
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss limitedLinearV 1;
    div(phi,Wxyz)      Gauss limitedLinearV 1;
    div(phi,k)      Gauss upwind;
    div(phi,epsilon) Gauss upwind;
    div(phi,omega) Gauss upwind;
    div(phi,R)      Gauss upwind;
    div(R)          Gauss linear;
    div(phid,p)     Gauss limitedLinear 1;
    div(phiU,p)     Gauss limitedLinear 1;
    div(phiWxyz,p)     Gauss limitedLinear 1;
    div(phi,e)      Gauss limitedLinear 1;
    div((muEff*dev2(grad(U).T()))) Gauss linear;
    div((muEff*dev2(grad(Wxyz).T()))) Gauss linear;
}

laplacianSchemes
{
    default         none;
    laplacian(muEff,U) Gauss linear corrected;
    laplacian(muEff,Wxyz) Gauss linear corrected;
    laplacian(DkEff,k) Gauss linear corrected;
    laplacian(DREff,R) Gauss linear corrected;
    laplacian(DepsilonEff,epsilon) Gauss linear corrected;
    laplacian(DomegaEff,omega) Gauss linear corrected;
    laplacian((rho*(1|A(U))),p) Gauss linear corrected;
    laplacian((rho*(1|A(Wxyz))),p) Gauss linear corrected;
    laplacian(alphaEff,e) Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p;
}


// ************************************************************************* //
